TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
  __IO uint32_t PKA_RAM_DATA_175_;                 /* !< (@ 0x000162BC) PKA DATA RAM Location 175 */
  __IO uint32_t PKA_RAM_DATA_176_;                 /* !< (@ 0x000162C0) PKA DATA RAM Location 176 */
  __IO uint32_t PKA_RAM_DATA_177_;                 /* !< (@ 0x000162C4) PKA DATA RAM Location 177 */
  __IO uint32_t PKA_RAM_DATA_178_;                 /* !< (@ 0x000162C8) PKA DATA RAM Location 178 */
  __IO uint32_t PKA_RAM_DATA_179_;                 /* !< (@ 0x000162CC) PKA DATA RAM Location 179 */
  __IO uint32_t PKA_RAM_DATA_180_;                 /* !< (@ 0x000162D0) PKA DATA RAM Location 180 */
  __IO uint32_t PKA_RAM_DATA_181_;                 /* !< (@ 0x000162D4) PKA DATA RAM Location 181 */
  __IO uint32_t PKA_RAM_DATA_182_;                 /* !< (@ 0x000162D8) PKA DATA RAM Location 182 */
  __IO uint32_t PKA_RAM_DATA_183_;                 /* !< (@ 0x000162DC) PKA DATA RAM Location 183 */
  __IO uint32_t PKA_RAM_DATA_184_;                 /* !< (@ 0x000162E0) PKA DATA RAM Location 184 */
  __IO uint32_t PKA_RAM_DATA_185_;                 /* !< (@ 0x000162E4) PKA DATA RAM Location 185 */
  __IO uint32_t PKA_RAM_DATA_186_;                 /* !< (@ 0x000162E8) PKA DATA RAM Location 186 */
  __IO uint32_t PKA_RAM_DATA_187_;                 /* !< (@ 0x000162EC) PKA DATA RAM Location 187 */
  __IO uint32_t PKA_RAM_DATA_188_;                 /* !< (@ 0x000162F0) PKA DATA RAM Location 188 */
  __IO uint32_t PKA_RAM_DATA_189_;                 /* !< (@ 0x000162F4) PKA DATA RAM Location 189 */
  __IO uint32_t PKA_RAM_DATA_190_;                 /* !< (@ 0x000162F8) PKA DATA RAM Location 190 */
  __IO uint32_t PKA_RAM_DATA_191_;                 /* !< (@ 0x000162FC) PKA DATA RAM Location 191 */
  __IO uint32_t PKA_RAM_DATA_192_;                 /* !< (@ 0x00016300) PKA DATA RAM Location 192 */
  __IO uint32_t PKA_RAM_DATA_193_;                 /* !< (@ 0x00016304) PKA DATA RAM Location 193 */
  __IO uint32_t PKA_RAM_DATA_194_;                 /* !< (@ 0x00016308) PKA DATA RAM Location 194 */
  __IO uint32_t PKA_RAM_DATA_195_;                 /* !< (@ 0x0001630C) PKA DATA RAM Location 195 */
  __IO uint32_t PKA_RAM_DATA_196_;                 /* !< (@ 0x00016310) PKA DATA RAM Location 196 */
  __IO uint32_t PKA_RAM_DATA_197_;                 /* !< (@ 0x00016314) PKA DATA RAM Location 197 */
  __IO uint32_t PKA_RAM_DATA_198_;                 /* !< (@ 0x00016318) PKA DATA RAM Location 198 */
  __IO uint32_t PKA_RAM_DATA_199_;                 /* !< (@ 0x0001631C) PKA DATA RAM Location 199 */
  __IO uint32_t PKA_RAM_DATA_200_;                 /* !< (@ 0x00016320) PKA DATA RAM Location 200 */
  __IO uint32_t PKA_RAM_DATA_201_;                 /* !< (@ 0x00016324) PKA DATA RAM Location 201 */
  __IO uint32_t PKA_RAM_DATA_202_;                 /* !< (@ 0x00016328) PKA DATA RAM Location 202 */
  __IO uint32_t PKA_RAM_DATA_203_;                 /* !< (@ 0x0001632C) PKA DATA RAM Location 203 */
  __IO uint32_t PKA_RAM_DATA_204_;                 /* !< (@ 0x00016330) PKA DATA RAM Location 204 */
  __IO uint32_t PKA_RAM_DATA_205_;                 /* !< (@ 0x00016334) PKA DATA RAM Location 205 */
  __IO uint32_t PKA_RAM_DATA_206_;                 /* !< (@ 0x00016338) PKA DATA RAM Location 206 */
  __IO uint32_t PKA_RAM_DATA_207_;                 /* !< (@ 0x0001633C) PKA DATA RAM Location 207 */
  __IO uint32_t PKA_RAM_DATA_208_;                 /* !< (@ 0x00016340) PKA DATA RAM Location 208 */
  __IO uint32_t PKA_RAM_DATA_209_;                 /* !< (@ 0x00016344) PKA DATA RAM Location 209 */
  __IO uint32_t PKA_RAM_DATA_210_;                 /* !< (@ 0x00016348) PKA DATA RAM Location 210 */
  __IO uint32_t PKA_RAM_DATA_211_;                 /* !< (@ 0x0001634C) PKA DATA RAM Location 211 */
  __IO uint32_t PKA_RAM_DATA_212_;                 /* !< (@ 0x00016350) PKA DATA RAM Location 212 */
  __IO uint32_t PKA_RAM_DATA_213_;                 /* !< (@ 0x00016354) PKA DATA RAM Location 213 */
  __IO uint32_t PKA_RAM_DATA_214_;                 /* !< (@ 0x00016358) PKA DATA RAM Location 214 */
  __IO uint32_t PKA_RAM_DATA_215_;                 /* !< (@ 0x0001635C) PKA DATA RAM Location 215 */
  __IO uint32_t PKA_RAM_DATA_216_;                 /* !< (@ 0x00016360) PKA DATA RAM Location 216 */
  __IO uint32_t PKA_RAM_DATA_217_;                 /* !< (@ 0x00016364) PKA DATA RAM Location 217 */
  __IO uint32_t PKA_RAM_DATA_218_;                 /* !< (@ 0x00016368) PKA DATA RAM Location 218 */
  __IO uint32_t PKA_RAM_DATA_219_;                 /* !< (@ 0x0001636C) PKA DATA RAM Location 219 */
  __IO uint32_t PKA_RAM_DATA_220_;                 /* !< (@ 0x00016370) PKA DATA RAM Location 220 */
  __IO uint32_t PKA_RAM_DATA_221_;                 /* !< (@ 0x00016374) PKA DATA RAM Location 221 */
  __IO uint32_t PKA_RAM_DATA_222_;                 /* !< (@ 0x00016378) PKA DATA RAM Location 222 */
  __IO uint32_t PKA_RAM_DATA_223_;                 /* !< (@ 0x0001637C) PKA DATA RAM Location 223 */
  __IO uint32_t PKA_RAM_DATA_224_;                 /* !< (@ 0x00016380) PKA DATA RAM Location 224 */
  __IO uint32_t PKA_RAM_DATA_225_;                 /* !< (@ 0x00016384) PKA DATA RAM Location 225 */
  __IO uint32_t PKA_RAM_DATA_226_;                 /* !< (@ 0x00016388) PKA DATA RAM Location 226 */
  __IO uint32_t PKA_RAM_DATA_227_;                 /* !< (@ 0x0001638C) PKA DATA RAM Location 227 */
  __IO uint32_t PKA_RAM_DATA_228_;                 /* !< (@ 0x00016390) PKA DATA RAM Location 228 */
  __IO uint32_t PKA_RAM_DATA_229_;                 /* !< (@ 0x00016394) PKA DATA RAM Location 229 */
  __IO uint32_t PKA_RAM_DATA_230_;                 /* !< (@ 0x00016398) PKA DATA RAM Location 230 */
  __IO uint32_t PKA_RAM_DATA_231_;                 /* !< (@ 0x0001639C) PKA DATA RAM Location 231 */
  __IO uint32_t PKA_RAM_DATA_232_;                 /* !< (@ 0x000163A0) PKA DATA RAM Location 232 */
  __IO uint32_t PKA_RAM_DATA_233_;                 /* !< (@ 0x000163A4) PKA DATA RAM Location 233 */
  __IO uint32_t PKA_RAM_DATA_234_;                 /* !< (@ 0x000163A8) PKA DATA RAM Location 234 */
  __IO uint32_t PKA_RAM_DATA_235_;                 /* !< (@ 0x000163AC) PKA DATA RAM Location 235 */
  __IO uint32_t PKA_RAM_DATA_236_;                 /* !< (@ 0x000163B0) PKA DATA RAM Location 236 */
  __IO uint32_t PKA_RAM_DATA_237_;                 /* !< (@ 0x000163B4) PKA DATA RAM Location 237 */
  __IO uint32_t PKA_RAM_DATA_238_;                 /* !< (@ 0x000163B8) PKA DATA RAM Location 238 */
  __IO uint32_t PKA_RAM_DATA_239_;                 /* !< (@ 0x000163BC) PKA DATA RAM Location 239 */
  __IO uint32_t PKA_RAM_DATA_240_;                 /* !< (@ 0x000163C0) PKA DATA RAM Location 240 */
  __IO uint32_t PKA_RAM_DATA_241_;                 /* !< (@ 0x000163C4) PKA DATA RAM Location 241 */
  __IO uint32_t PKA_RAM_DATA_242_;                 /* !< (@ 0x000163C8) PKA DATA RAM Location 242 */
  __IO uint32_t PKA_RAM_DATA_243_;                 /* !< (@ 0x000163CC) PKA DATA RAM Location 243 */
  __IO uint32_t PKA_RAM_DATA_244_;                 /* !< (@ 0x000163D0) PKA DATA RAM Location 244 */
  __IO uint32_t PKA_RAM_DATA_245_;                 /* !< (@ 0x000163D4) PKA DATA RAM Location 245 */
  __IO uint32_t PKA_RAM_DATA_246_;                 /* !< (@ 0x000163D8) PKA DATA RAM Location 246 */
  __IO uint32_t PKA_RAM_DATA_247_;                 /* !< (@ 0x000163DC) PKA DATA RAM Location 247 */
  __IO uint32_t PKA_RAM_DATA_248_;                 /* !< (@ 0x000163E0) PKA DATA RAM Location 248 */
  __IO uint32_t PKA_RAM_DATA_249_;                 /* !< (@ 0x000163E4) PKA DATA RAM Location 249 */
  __IO uint32_t PKA_RAM_DATA_250_;                 /* !< (@ 0x000163E8) PKA DATA RAM Location 250 */
  __IO uint32_t PKA_RAM_DATA_251_;                 /* !< (@ 0x000163EC) PKA DATA RAM Location 251 */
  __IO uint32_t PKA_RAM_DATA_252_;                 /* !< (@ 0x000163F0) PKA DATA RAM Location 252 */
  __IO uint32_t PKA_RAM_DATA_253_;                 /* !< (@ 0x000163F4) PKA DATA RAM Location 253 */
  __IO uint32_t PKA_RAM_DATA_254_;                 /* !< (@ 0x000163F8) PKA DATA RAM Location 254 */
  __IO uint32_t PKA_RAM_DATA_255_;                 /* !< (@ 0x000163FC) PKA DATA RAM Location 255 */
  __IO uint32_t PKA_RAM_DATA_256_;                 /* !< (@ 0x00016400) PKA DATA RAM Location 256 */
  __IO uint32_t PKA_RAM_DATA_257_;                 /* !< (@ 0x00016404) PKA DATA RAM Location 257 */
  __IO uint32_t PKA_RAM_DATA_258_;                 /* !< (@ 0x00016408) PKA DATA RAM Location 258 */
  __IO uint32_t PKA_RAM_DATA_259_;                 /* !< (@ 0x0001640C) PKA DATA RAM Location 259 */
  __IO uint32_t PKA_RAM_DATA_260_;                 /* !< (@ 0x00016410) PKA DATA RAM Location 260 */
  __IO uint32_t PKA_RAM_DATA_261_;                 /* !< (@ 0x00016414) PKA DATA RAM Location 261 */
  __IO uint32_t PKA_RAM_DATA_262_;                 /* !< (@ 0x00016418) PKA DATA RAM Location 262 */
  __IO uint32_t PKA_RAM_DATA_263_;                 /* !< (@ 0x0001641C) PKA DATA RAM Location 263 */
  __IO uint32_t PKA_RAM_DATA_264_;                 /* !< (@ 0x00016420) PKA DATA RAM Location 264 */
  __IO uint32_t PKA_RAM_DATA_265_;                 /* !< (@ 0x00016424) PKA DATA RAM Location 265 */
  __IO uint32_t PKA_RAM_DATA_266_;                 /* !< (@ 0x00016428) PKA DATA RAM Location 266 */
  __IO uint32_t PKA_RAM_DATA_267_;                 /* !< (@ 0x0001642C) PKA DATA RAM Location 267 */
  __IO uint32_t PKA_RAM_DATA_268_;                 /* !< (@ 0x00016430) PKA DATA RAM Location 268 */
  __IO uint32_t PKA_RAM_DATA_269_;                 /* !< (@ 0x00016434) PKA DATA RAM Location 269 */
  __IO uint32_t PKA_RAM_DATA_270_;                 /* !< (@ 0x00016438) PKA DATA RAM Location 270 */
  __IO uint32_t PKA_RAM_DATA_271_;                 /* !< (@ 0x0001643C) PKA DATA RAM Location 271 */
  __IO uint32_t PKA_RAM_DATA_272_;                 /* !< (@ 0x00016440) PKA DATA RAM Location 272 */
  __IO uint32_t PKA_RAM_DATA_273_;                 /* !< (@ 0x00016444) PKA DATA RAM Location 273 */
  __IO uint32_t PKA_RAM_DATA_274_;                 /* !< (@ 0x00016448) PKA DATA RAM Location 274 */
  __IO uint32_t PKA_RAM_DATA_275_;                 /* !< (@ 0x0001644C) PKA DATA RAM Location 275 */
  __IO uint32_t PKA_RAM_DATA_276_;                 /* !< (@ 0x00016450) PKA DATA RAM Location 276 */
  __IO uint32_t PKA_RAM_DATA_277_;                 /* !< (@ 0x00016454) PKA DATA RAM Location 277 */
  __IO uint32_t PKA_RAM_DATA_278_;                 /* !< (@ 0x00016458) PKA DATA RAM Location 278 */
  __IO uint32_t PKA_RAM_DATA_279_;                 /* !< (@ 0x0001645C) PKA DATA RAM Location 279 */
  __IO uint32_t PKA_RAM_DATA_280_;                 /* !< (@ 0x00016460) PKA DATA RAM Location 280 */
  __IO uint32_t PKA_RAM_DATA_281_;                 /* !< (@ 0x00016464) PKA DATA RAM Location 281 */
  __IO uint32_t PKA_RAM_DATA_282_;                 /* !< (@ 0x00016468) PKA DATA RAM Location 282 */
  __IO uint32_t PKA_RAM_DATA_283_;                 /* !< (@ 0x0001646C) PKA DATA RAM Location 283 */
  __IO uint32_t PKA_RAM_DATA_284_;                 /* !< (@ 0x00016470) PKA DATA RAM Location 284 */
  __IO uint32_t PKA_RAM_DATA_285_;                 /* !< (@ 0x00016474) PKA DATA RAM Location 285 */
  __IO uint32_t PKA_RAM_DATA_286_;                 /* !< (@ 0x00016478) PKA DATA RAM Location 286 */
  __IO uint32_t PKA_RAM_DATA_287_;                 /* !< (@ 0x0001647C) PKA DATA RAM Location 287 */
  __IO uint32_t PKA_RAM_DATA_288_;                 /* !< (@ 0x00016480) PKA DATA RAM Location 288 */
  __IO uint32_t PKA_RAM_DATA_289_;                 /* !< (@ 0x00016484) PKA DATA RAM Location 289 */
  __IO uint32_t PKA_RAM_DATA_290_;                 /* !< (@ 0x00016488) PKA DATA RAM Location 290 */
  __IO uint32_t PKA_RAM_DATA_291_;                 /* !< (@ 0x0001648C) PKA DATA RAM Location 291 */
  __IO uint32_t PKA_RAM_DATA_292_;                 /* !< (@ 0x00016490) PKA DATA RAM Location 292 */
  __IO uint32_t PKA_RAM_DATA_293_;                 /* !< (@ 0x00016494) PKA DATA RAM Location 293 */
  __IO uint32_t PKA_RAM_DATA_294_;                 /* !< (@ 0x00016498) PKA DATA RAM Location 294 */
  __IO uint32_t PKA_RAM_DATA_295_;                 /* !< (@ 0x0001649C) PKA DATA RAM Location 295 */
  __IO uint32_t PKA_RAM_DATA_296_;                 /* !< (@ 0x000164A0) PKA DATA RAM Location 296 */
  __IO uint32_t PKA_RAM_DATA_297_;                 /* !< (@ 0x000164A4) PKA DATA RAM Location 297 */
  __IO uint32_t PKA_RAM_DATA_298_;                 /* !< (@ 0x000164A8) PKA DATA RAM Location 298 */
  __IO uint32_t PKA_RAM_DATA_299_;                 /* !< (@ 0x000164AC) PKA DATA RAM Location 299 */
  __IO uint32_t PKA_RAM_DATA_300_;                 /* !< (@ 0x000164B0) PKA DATA RAM Location 300 */
  __IO uint32_t PKA_RAM_DATA_301_;                 /* !< (@ 0x000164B4) PKA DATA RAM Location 301 */
  __IO uint32_t PKA_RAM_DATA_302_;                 /* !< (@ 0x000164B8) PKA DATA RAM Location 302 */
  __IO uint32_t PKA_RAM_DATA_303_;                 /* !< (@ 0x000164BC) PKA DATA RAM Location 303 */
  __IO uint32_t PKA_RAM_DATA_304_;                 /* !< (@ 0x000164C0) PKA DATA RAM Location 304 */
  __IO uint32_t PKA_RAM_DATA_305_;                 /* !< (@ 0x000164C4) PKA DATA RAM Location 305 */
  __IO uint32_t PKA_RAM_DATA_306_;                 /* !< (@ 0x000164C8) PKA DATA RAM Location 306 */
  __IO uint32_t PKA_RAM_DATA_307_;                 /* !< (@ 0x000164CC) PKA DATA RAM Location 307 */
  __IO uint32_t PKA_RAM_DATA_308_;                 /* !< (@ 0x000164D0) PKA DATA RAM Location 308 */
  __IO uint32_t PKA_RAM_DATA_309_;                 /* !< (@ 0x000164D4) PKA DATA RAM Location 309 */
  __IO uint32_t PKA_RAM_DATA_310_;                 /* !< (@ 0x000164D8) PKA DATA RAM Location 310 */
  __IO uint32_t PKA_RAM_DATA_311_;                 /* !< (@ 0x000164DC) PKA DATA RAM Location 311 */
  __IO uint32_t PKA_RAM_DATA_312_;                 /* !< (@ 0x000164E0) PKA DATA RAM Location 312 */
  __IO uint32_t PKA_RAM_DATA_313_;                 /* !< (@ 0x000164E4) PKA DATA RAM Location 313 */
  __IO uint32_t PKA_RAM_DATA_314_;                 /* !< (@ 0x000164E8) PKA DATA RAM Location 314 */
  __IO uint32_t PKA_RAM_DATA_315_;                 /* !< (@ 0x000164EC) PKA DATA RAM Location 315 */
  __IO uint32_t PKA_RAM_DATA_316_;                 /* !< (@ 0x000164F0) PKA DATA RAM Location 316 */
  __IO uint32_t PKA_RAM_DATA_317_;                 /* !< (@ 0x000164F4) PKA DATA RAM Location 317 */
  __IO uint32_t PKA_RAM_DATA_318_;                 /* !< (@ 0x000164F8) PKA DATA RAM Location 318 */
  __IO uint32_t PKA_RAM_DATA_319_;                 /* !< (@ 0x000164FC) PKA DATA RAM Location 319 */
  __IO uint32_t PKA_RAM_DATA_320_;                 /* !< (@ 0x00016500) PKA DATA RAM Location 320 */
  __IO uint32_t PKA_RAM_DATA_321_;                 /* !< (@ 0x00016504) PKA DATA RAM Location 321 */
  __IO uint32_t PKA_RAM_DATA_322_;                 /* !< (@ 0x00016508) PKA DATA RAM Location 322 */
  __IO uint32_t PKA_RAM_DATA_323_;                 /* !< (@ 0x0001650C) PKA DATA RAM Location 323 */
  __IO uint32_t PKA_RAM_DATA_324_;                 /* !< (@ 0x00016510) PKA DATA RAM Location 324 */
  __IO uint32_t PKA_RAM_DATA_325_;                 /* !< (@ 0x00016514) PKA DATA RAM Location 325 */
  __IO uint32_t PKA_RAM_DATA_326_;                 /* !< (@ 0x00016518) PKA DATA RAM Location 326 */
  __IO uint32_t PKA_RAM_DATA_327_;                 /* !< (@ 0x0001651C) PKA DATA RAM Location 327 */
  __IO uint32_t PKA_RAM_DATA_328_;                 /* !< (@ 0x00016520) PKA DATA RAM Location 328 */
  __IO uint32_t PKA_RAM_DATA_329_;                 /* !< (@ 0x00016524) PKA DATA RAM Location 329 */
  __IO uint32_t PKA_RAM_DATA_330_;                 /* !< (@ 0x00016528) PKA DATA RAM Location 330 */
  __IO uint32_t PKA_RAM_DATA_331_;                 /* !< (@ 0x0001652C) PKA DATA RAM Location 331 */
  __IO uint32_t PKA_RAM_DATA_332_;                 /* !< (@ 0x00016530) PKA DATA RAM Location 332 */
  __IO uint32_t PKA_RAM_DATA_333_;                 /* !< (@ 0x00016534) PKA DATA RAM Location 333 */
  __IO uint32_t PKA_RAM_DATA_334_;                 /* !< (@ 0x00016538) PKA DATA RAM Location 334 */
  __IO uint32_t PKA_RAM_DATA_335_;                 /* !< (@ 0x0001653C) PKA DATA RAM Location 335 */
  __IO uint32_t PKA_RAM_DATA_336_;                 /* !< (@ 0x00016540) PKA DATA RAM Location 336 */
  __IO uint32_t PKA_RAM_DATA_337_;                 /* !< (@ 0x00016544) PKA DATA RAM Location 337 */
  __IO uint32_t PKA_RAM_DATA_338_;                 /* !< (@ 0x00016548) PKA DATA RAM Location 338 */
  __IO uint32_t PKA_RAM_DATA_339_;                 /* !< (@ 0x0001654C) PKA DATA RAM Location 339 */
  __IO uint32_t PKA_RAM_DATA_340_;                 /* !< (@ 0x00016550) PKA DATA RAM Location 340 */
  __IO uint32_t PKA_RAM_DATA_341_;                 /* !< (@ 0x00016554) PKA DATA RAM Location 341 */
  __IO uint32_t PKA_RAM_DATA_342_;                 /* !< (@ 0x00016558) PKA DATA RAM Location 342 */
  __IO uint32_t PKA_RAM_DATA_343_;                 /* !< (@ 0x0001655C) PKA DATA RAM Location 343 */
  __IO uint32_t PKA_RAM_DATA_344_;                 /* !< (@ 0x00016560) PKA DATA RAM Location 344 */
  __IO uint32_t PKA_RAM_DATA_345_;                 /* !< (@ 0x00016564) PKA DATA RAM Location 345 */
  __IO uint32_t PKA_RAM_DATA_346_;                 /* !< (@ 0x00016568) PKA DATA RAM Location 346 */
  __IO uint32_t PKA_RAM_DATA_347_;                 /* !< (@ 0x0001656C) PKA DATA RAM Location 347 */
  __IO uint32_t PKA_RAM_DATA_348_;                 /* !< (@ 0x00016570) PKA DATA RAM Location 348 */
  __IO uint32_t PKA_RAM_DATA_349_;                 /* !< (@ 0x00016574) PKA DATA RAM Location 349 */
  __IO uint32_t PKA_RAM_DATA_350_;                 /* !< (@ 0x00016578) PKA DATA RAM Location 350 */
  __IO uint32_t PKA_RAM_DATA_351_;                 /* !< (@ 0x0001657C) PKA DATA RAM Location 351 */
  __IO uint32_t PKA_RAM_DATA_352_;                 /* !< (@ 0x00016580) PKA DATA RAM Location 352 */
  __IO uint32_t PKA_RAM_DATA_353_;                 /* !< (@ 0x00016584) PKA DATA RAM Location 353 */
  __IO uint32_t PKA_RAM_DATA_354_;                 /* !< (@ 0x00016588) PKA DATA RAM Location 354 */
  __IO uint32_t PKA_RAM_DATA_355_;                 /* !< (@ 0x0001658C) PKA DATA RAM Location 355 */
  __IO uint32_t PKA_RAM_DATA_356_;                 /* !< (@ 0x00016590) PKA DATA RAM Location 356 */
  __IO uint32_t PKA_RAM_DATA_357_;                 /* !< (@ 0x00016594) PKA DATA RAM Location 357 */
  __IO uint32_t PKA_RAM_DATA_358_;                 /* !< (@ 0x00016598) PKA DATA RAM Location 358 */
  __IO uint32_t PKA_RAM_DATA_359_;                 /* !< (@ 0x0001659C) PKA DATA RAM Location 359 */
  __IO uint32_t PKA_RAM_DATA_360_;                 /* !< (@ 0x000165A0) PKA DATA RAM Location 360 */
  __IO uint32_t PKA_RAM_DATA_361_;                 /* !< (@ 0x000165A4) PKA DATA RAM Location 361 */
  __IO uint32_t PKA_RAM_DATA_362_;                 /* !< (@ 0x000165A8) PKA DATA RAM Location 362 */
  __IO uint32_t PKA_RAM_DATA_363_;                 /* !< (@ 0x000165AC) PKA DATA RAM Location 363 */
  __IO uint32_t PKA_RAM_DATA_364_;                 /* !< (@ 0x000165B0) PKA DATA RAM Location 364 */
  __IO uint32_t PKA_RAM_DATA_365_;                 /* !< (@ 0x000165B4) PKA DATA RAM Location 365 */
  __IO uint32_t PKA_RAM_DATA_366_;                 /* !< (@ 0x000165B8) PKA DATA RAM Location 366 */
  __IO uint32_t PKA_RAM_DATA_367_;                 /* !< (@ 0x000165BC) PKA DATA RAM Location 367 */
  __IO uint32_t PKA_RAM_DATA_368_;                 /* !< (@ 0x000165C0) PKA DATA RAM Location 368 */
  __IO uint32_t PKA_RAM_DATA_369_;                 /* !< (@ 0x000165C4) PKA DATA RAM Location 369 */
  __IO uint32_t PKA_RAM_DATA_370_;                 /* !< (@ 0x000165C8) PKA DATA RAM Location 370 */
  __IO uint32_t PKA_RAM_DATA_371_;                 /* !< (@ 0x000165CC) PKA DATA RAM Location 371 */
  __IO uint32_t PKA_RAM_DATA_372_;                 /* !< (@ 0x000165D0) PKA DATA RAM Location 372 */
  __IO uint32_t PKA_RAM_DATA_373_;                 /* !< (@ 0x000165D4) PKA DATA RAM Location 373 */
  __IO uint32_t PKA_RAM_DATA_374_;                 /* !< (@ 0x000165D8) PKA DATA RAM Location 374 */
  __IO uint32_t PKA_RAM_DATA_375_;                 /* !< (@ 0x000165DC) PKA DATA RAM Location 375 */
  __IO uint32_t PKA_RAM_DATA_376_;                 /* !< (@ 0x000165E0) PKA DATA RAM Location 376 */
  __IO uint32_t PKA_RAM_DATA_377_;                 /* !< (@ 0x000165E4) PKA DATA RAM Location 377 */
  __IO uint32_t PKA_RAM_DATA_378_;                 /* !< (@ 0x000165E8) PKA DATA RAM Location 378 */
  __IO uint32_t PKA_RAM_DATA_379_;                 /* !< (@ 0x000165EC) PKA DATA RAM Location 379 */
  __IO uint32_t PKA_RAM_DATA_380_;                 /* !< (@ 0x000165F0) PKA DATA RAM Location 380 */
  __IO uint32_t PKA_RAM_DATA_381_;                 /* !< (@ 0x000165F4) PKA DATA RAM Location 381 */
  __IO uint32_t PKA_RAM_DATA_382_;                 /* !< (@ 0x000165F8) PKA DATA RAM Location 382 */
  __IO uint32_t PKA_RAM_DATA_383_;                 /* !< (@ 0x000165FC) PKA DATA RAM Location 383 */
  __IO uint32_t PKA_RAM_DATA_384_;                 /* !< (@ 0x00016600) PKA DATA RAM Location 384 */
  __IO uint32_t PKA_RAM_DATA_385_;                 /* !< (@ 0x00016604) PKA DATA RAM Location 385 */
  __IO uint32_t PKA_RAM_DATA_386_;                 /* !< (@ 0x00016608) PKA DATA RAM Location 386 */
  __IO uint32_t PKA_RAM_DATA_387_;                 /* !< (@ 0x0001660C) PKA DATA RAM Location 387 */
  __IO uint32_t PKA_RAM_DATA_388_;                 /* !< (@ 0x00016610) PKA DATA RAM Location 388 */
  __IO uint32_t PKA_RAM_DATA_389_;                 /* !< (@ 0x00016614) PKA DATA RAM Location 389 */
  __IO uint32_t PKA_RAM_DATA_390_;                 /* !< (@ 0x00016618) PKA DATA RAM Location 390 */
  __IO uint32_t PKA_RAM_DATA_391_;                 /* !< (@ 0x0001661C) PKA DATA RAM Location 391 */
  __IO uint32_t PKA_RAM_DATA_392_;                 /* !< (@ 0x00016620) PKA DATA RAM Location 392 */
  __IO uint32_t PKA_RAM_DATA_393_;                 /* !< (@ 0x00016624) PKA DATA RAM Location 393 */
  __IO uint32_t PKA_RAM_DATA_394_;                 /* !< (@ 0x00016628) PKA DATA RAM Location 394 */
  __IO uint32_t PKA_RAM_DATA_395_;                 /* !< (@ 0x0001662C) PKA DATA RAM Location 395 */
  __IO uint32_t PKA_RAM_DATA_396_;                 /* !< (@ 0x00016630) PKA DATA RAM Location 396 */
  __IO uint32_t PKA_RAM_DATA_397_;                 /* !< (@ 0x00016634) PKA DATA RAM Location 397 */
  __IO uint32_t PKA_RAM_DATA_398_;                 /* !< (@ 0x00016638) PKA DATA RAM Location 398 */
  __IO uint32_t PKA_RAM_DATA_399_;                 /* !< (@ 0x0001663C) PKA DATA RAM Location 399 */
  __IO uint32_t PKA_RAM_DATA_400_;                 /* !< (@ 0x00016640) PKA DATA RAM Location 400 */
  __IO uint32_t PKA_RAM_DATA_401_;                 /* !< (@ 0x00016644) PKA DATA RAM Location 401 */
  __IO uint32_t PKA_RAM_DATA_402_;                 /* !< (@ 0x00016648) PKA DATA RAM Location 402 */
  __IO uint32_t PKA_RAM_DATA_403_;                 /* !< (@ 0x0001664C) PKA DATA RAM Location 403 */
  __IO uint32_t PKA_RAM_DATA_404_;                 /* !< (@ 0x00016650) PKA DATA RAM Location 404 */
  __IO uint32_t PKA_RAM_DATA_405_;                 /* !< (@ 0x00016654) PKA DATA RAM Location 405 */
  __IO uint32_t PKA_RAM_DATA_406_;                 /* !< (@ 0x00016658) PKA DATA RAM Location 406 */
  __IO uint32_t PKA_RAM_DATA_407_;                 /* !< (@ 0x0001665C) PKA DATA RAM Location 407 */
  __IO uint32_t PKA_RAM_DATA_408_;                 /* !< (@ 0x00016660) PKA DATA RAM Location 408 */
  __IO uint32_t PKA_RAM_DATA_409_;                 /* !< (@ 0x00016664) PKA DATA RAM Location 409 */
  __IO uint32_t PKA_RAM_DATA_410_;                 /* !< (@ 0x00016668) PKA DATA RAM Location 410 */
  __IO uint32_t PKA_RAM_DATA_411_;                 /* !< (@ 0x0001666C) PKA DATA RAM Location 411 */
