TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_OPTIONS Bits */
/* PKA_PKA_OPTIONS[PKCP_CONFIGURATION] Bits */
#define PKA_PKA_OPTIONS_PKCP_CONFIGURATION_OFS   (0)                             /* !< PKCP_CONFIGURATION Offset */
#define PKA_PKA_OPTIONS_PKCP_CONFIGURATION_MASK  ((uint32_t)0x00000003U)         /* !< PKCP_Configuration */
/* PKA_PKA_OPTIONS[LNME_CONFIGURATION] Bits */
#define PKA_PKA_OPTIONS_LNME_CONFIGURATION_OFS   (2)                             /* !< LNME_CONFIGURATION Offset */
#define PKA_PKA_OPTIONS_LNME_CONFIGURATION_MASK  ((uint32_t)0x0000001CU)         /* !< LNME_configuration */
/* PKA_PKA_OPTIONS[SEQUENCER_CONFIGURATION] Bits */
#define PKA_PKA_OPTIONS_SEQUENCER_CONFIGURATION_OFS (5)                             /* !< SEQUENCER_CONFIGURATION Offset */
#define PKA_PKA_OPTIONS_SEQUENCER_CONFIGURATION_MASK ((uint32_t)0x00000060U)         /* !< Sequencer_Configuration */
/* PKA_PKA_OPTIONS[PROGRAM_RAM] Bits */
#define PKA_PKA_OPTIONS_PROGRAM_RAM_OFS          (7)                             /* !< PROGRAM_RAM Offset */
#define PKA_PKA_OPTIONS_PROGRAM_RAM_MASK         ((uint32_t)0x00000080U)         /* !< Program_RAM */
/* PKA_PKA_OPTIONS[PROTECTION_OPTION] Bits */
#define PKA_PKA_OPTIONS_PROTECTION_OPTION_OFS    (8)                             /* !< PROTECTION_OPTION Offset */
#define PKA_PKA_OPTIONS_PROTECTION_OPTION_MASK   ((uint32_t)0x00000700U)         /* !< Protection_option */
/* PKA_PKA_OPTIONS[INT_MASKING] Bits */
#define PKA_PKA_OPTIONS_INT_MASKING_OFS          (11)                            /* !< INT_MASKING Offset */
#define PKA_PKA_OPTIONS_INT_MASKING_MASK         ((uint32_t)0x00000800U)         /* !< Int_masking */
/* PKA_PKA_OPTIONS[MMM3A] Bits */
#define PKA_PKA_OPTIONS_MMM3A_OFS                (12)                            /* !< MMM3A Offset */
#define PKA_PKA_OPTIONS_MMM3A_MASK               ((uint32_t)0x00001000U)         /* !< MMM3A */
/* PKA_PKA_OPTIONS[ZEROIZATION] Bits */
#define PKA_PKA_OPTIONS_ZEROIZATION_OFS          (13)                            /* !< ZEROIZATION Offset */
#define PKA_PKA_OPTIONS_ZEROIZATION_MASK         ((uint32_t)0x00002000U)         /* !< Zeroization */

/* PKA_PKA_SW_REV Bits */
/* PKA_PKA_SW_REV[BASIC_EIP_NUMBER] Bits */
#define PKA_PKA_SW_REV_BASIC_EIP_NUMBER_OFS      (0)                             /* !< BASIC_EIP_NUMBER Offset */
#define PKA_PKA_SW_REV_BASIC_EIP_NUMBER_MASK     ((uint32_t)0x000000FFU)         /* !< Input Data on which hash is
                                                                                    computed */
/* PKA_PKA_SW_REV[COMPLEMENT_OF_BASIC_EIP_NUMBER] Bits */
#define PKA_PKA_SW_REV_COMPLEMENT_OF_BASIC_EIP_NUMBER_OFS (8)                             /* !< COMPLEMENT_OF_BASIC_EIP_NUMBER
                                                                                    Offset */
#define PKA_PKA_SW_REV_COMPLEMENT_OF_BASIC_EIP_NUMBER_MASK ((uint32_t)0x0000FF00U)         /* !< Write 1 to indicate data is
                                                                                    available */
/* PKA_PKA_SW_REV[FW_PATCH_LEVEL] Bits */
#define PKA_PKA_SW_REV_FW_PATCH_LEVEL_OFS        (16)                            /* !< FW_PATCH_LEVEL Offset */
#define PKA_PKA_SW_REV_FW_PATCH_LEVEL_MASK       ((uint32_t)0x000F0000U)         /* !< Write 1 to indicate length is
                                                                                    available */
/* PKA_PKA_SW_REV[MAJOR_FW_REVISION] Bits */
#define PKA_PKA_SW_REV_MAJOR_FW_REVISION_OFS     (20)                            /* !< MAJOR_FW_REVISION Offset */
#define PKA_PKA_SW_REV_MAJOR_FW_REVISION_MASK    ((uint32_t)0x00F00000U)
/* PKA_PKA_SW_REV[MINOR_FW_REVISION] Bits */
#define PKA_PKA_SW_REV_MINOR_FW_REVISION_OFS     (24)                            /* !< MINOR_FW_REVISION Offset */
#define PKA_PKA_SW_REV_MINOR_FW_REVISION_MASK    ((uint32_t)0x0F000000U)         /* !< Write 1 to indicate mode is
                                                                                    available */
/* PKA_PKA_SW_REV[FIRMWARE_CAPABILITIES] Bits */
#define PKA_PKA_SW_REV_FIRMWARE_CAPABILITIES_OFS (28)                            /* !< FIRMWARE_CAPABILITIES Offset */
#define PKA_PKA_SW_REV_FIRMWARE_CAPABILITIES_MASK ((uint32_t)0xF0000000U)

/* PKA_PKA_REVISION Bits */
/* PKA_PKA_REVISION[BASIC_EIP_NUMBER] Bits */
#define PKA_PKA_REVISION_BASIC_EIP_NUMBER_OFS    (0)                             /* !< BASIC_EIP_NUMBER Offset */
#define PKA_PKA_REVISION_BASIC_EIP_NUMBER_MASK   ((uint32_t)0x000000FFU)         /* !< Basic_EIP_number */
/* PKA_PKA_REVISION[COMPLEMENT_OF_BASIC_EIP_NUMBER] Bits */
#define PKA_PKA_REVISION_COMPLEMENT_OF_BASIC_EIP_NUMBER_OFS (8)                             /* !< COMPLEMENT_OF_BASIC_EIP_NUMBER
                                                                                    Offset */
#define PKA_PKA_REVISION_COMPLEMENT_OF_BASIC_EIP_NUMBER_MASK ((uint32_t)0x0000FF00U)         /* !< Complement_of_Basic_EIP_number */
/* PKA_PKA_REVISION[HW_PATCH_LEVEL] Bits */
#define PKA_PKA_REVISION_HW_PATCH_LEVEL_OFS      (16)                            /* !< HW_PATCH_LEVEL Offset */
#define PKA_PKA_REVISION_HW_PATCH_LEVEL_MASK     ((uint32_t)0x000F0000U)         /* !< HW_patch_level */
/* PKA_PKA_REVISION[MAJOR_HW_REVISION] Bits */
#define PKA_PKA_REVISION_MAJOR_HW_REVISION_OFS   (20)                            /* !< MAJOR_HW_REVISION Offset */
#define PKA_PKA_REVISION_MAJOR_HW_REVISION_MASK  ((uint32_t)0x00F00000U)         /* !< Major_HW_Revision */
/* PKA_PKA_REVISION[MINOR_HW_REVISION] Bits */
#define PKA_PKA_REVISION_MINOR_HW_REVISION_OFS   (24)                            /* !< MINOR_HW_REVISION Offset */
#define PKA_PKA_REVISION_MINOR_HW_REVISION_MASK  ((uint32_t)0x0F000000U)         /* !< Minor_HW_Revision */

/* PKA_PKA_RAM_DATA_0_ Bits */
/* PKA_PKA_RAM_DATA_0_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_0__VECTOR_DATA_OFS      (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_0__VECTOR_DATA_MASK     ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_1_ Bits */
/* PKA_PKA_RAM_DATA_1_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_1__VECTOR_DATA_OFS      (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_1__VECTOR_DATA_MASK     ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_2_ Bits */
/* PKA_PKA_RAM_DATA_2_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_2__VECTOR_DATA_OFS      (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_2__VECTOR_DATA_MASK     ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_3_ Bits */
/* PKA_PKA_RAM_DATA_3_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_3__VECTOR_DATA_OFS      (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_3__VECTOR_DATA_MASK     ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_4_ Bits */
/* PKA_PKA_RAM_DATA_4_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_4__VECTOR_DATA_OFS      (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_4__VECTOR_DATA_MASK     ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

