TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_53_ Bits */
/* PKA_PKA_RAM_DATA_53_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_53__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_53__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_54_ Bits */
/* PKA_PKA_RAM_DATA_54_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_54__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_54__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_55_ Bits */
/* PKA_PKA_RAM_DATA_55_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_55__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_55__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_56_ Bits */
/* PKA_PKA_RAM_DATA_56_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_56__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_56__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_57_ Bits */
/* PKA_PKA_RAM_DATA_57_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_57__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_57__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_58_ Bits */
/* PKA_PKA_RAM_DATA_58_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_58__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_58__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_59_ Bits */
/* PKA_PKA_RAM_DATA_59_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_59__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_59__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_60_ Bits */
/* PKA_PKA_RAM_DATA_60_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_60__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_60__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_61_ Bits */
/* PKA_PKA_RAM_DATA_61_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_61__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_61__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_62_ Bits */
/* PKA_PKA_RAM_DATA_62_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_62__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_62__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_63_ Bits */
/* PKA_PKA_RAM_DATA_63_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_63__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_63__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_64_ Bits */
/* PKA_PKA_RAM_DATA_64_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_64__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_64__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_65_ Bits */
/* PKA_PKA_RAM_DATA_65_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_65__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_65__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_66_ Bits */
/* PKA_PKA_RAM_DATA_66_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_66__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_66__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_67_ Bits */
/* PKA_PKA_RAM_DATA_67_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_67__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_67__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_68_ Bits */
/* PKA_PKA_RAM_DATA_68_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_68__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_68__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_69_ Bits */
/* PKA_PKA_RAM_DATA_69_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_69__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_69__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_70_ Bits */
/* PKA_PKA_RAM_DATA_70_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_70__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_70__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_71_ Bits */
/* PKA_PKA_RAM_DATA_71_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_71__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_71__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_72_ Bits */
/* PKA_PKA_RAM_DATA_72_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_72__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_72__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_73_ Bits */
/* PKA_PKA_RAM_DATA_73_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_73__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_73__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

