TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_74_ Bits */
/* PKA_PKA_RAM_DATA_74_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_74__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_74__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_75_ Bits */
/* PKA_PKA_RAM_DATA_75_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_75__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_75__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_76_ Bits */
/* PKA_PKA_RAM_DATA_76_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_76__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_76__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_77_ Bits */
/* PKA_PKA_RAM_DATA_77_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_77__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_77__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_78_ Bits */
/* PKA_PKA_RAM_DATA_78_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_78__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_78__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_79_ Bits */
/* PKA_PKA_RAM_DATA_79_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_79__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_79__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_80_ Bits */
/* PKA_PKA_RAM_DATA_80_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_80__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_80__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_81_ Bits */
/* PKA_PKA_RAM_DATA_81_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_81__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_81__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_82_ Bits */
/* PKA_PKA_RAM_DATA_82_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_82__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_82__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_83_ Bits */
/* PKA_PKA_RAM_DATA_83_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_83__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_83__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_84_ Bits */
/* PKA_PKA_RAM_DATA_84_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_84__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_84__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_85_ Bits */
/* PKA_PKA_RAM_DATA_85_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_85__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_85__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_86_ Bits */
/* PKA_PKA_RAM_DATA_86_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_86__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_86__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_87_ Bits */
/* PKA_PKA_RAM_DATA_87_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_87__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_87__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_88_ Bits */
/* PKA_PKA_RAM_DATA_88_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_88__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_88__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_89_ Bits */
/* PKA_PKA_RAM_DATA_89_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_89__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_89__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_90_ Bits */
/* PKA_PKA_RAM_DATA_90_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_90__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_90__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_91_ Bits */
/* PKA_PKA_RAM_DATA_91_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_91__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_91__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_92_ Bits */
/* PKA_PKA_RAM_DATA_92_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_92__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_92__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_93_ Bits */
/* PKA_PKA_RAM_DATA_93_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_93__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_93__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_94_ Bits */
/* PKA_PKA_RAM_DATA_94_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_94__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_94__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

