TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_95_ Bits */
/* PKA_PKA_RAM_DATA_95_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_95__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_95__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_96_ Bits */
/* PKA_PKA_RAM_DATA_96_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_96__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_96__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_97_ Bits */
/* PKA_PKA_RAM_DATA_97_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_97__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_97__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_98_ Bits */
/* PKA_PKA_RAM_DATA_98_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_98__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_98__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_99_ Bits */
/* PKA_PKA_RAM_DATA_99_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_99__VECTOR_DATA_OFS     (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_99__VECTOR_DATA_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_100_ Bits */
/* PKA_PKA_RAM_DATA_100_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_100__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_100__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_101_ Bits */
/* PKA_PKA_RAM_DATA_101_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_101__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_101__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_102_ Bits */
/* PKA_PKA_RAM_DATA_102_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_102__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_102__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_103_ Bits */
/* PKA_PKA_RAM_DATA_103_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_103__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_103__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_104_ Bits */
/* PKA_PKA_RAM_DATA_104_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_104__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_104__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_105_ Bits */
/* PKA_PKA_RAM_DATA_105_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_105__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_105__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_106_ Bits */
/* PKA_PKA_RAM_DATA_106_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_106__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_106__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_107_ Bits */
/* PKA_PKA_RAM_DATA_107_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_107__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_107__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_108_ Bits */
/* PKA_PKA_RAM_DATA_108_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_108__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_108__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_109_ Bits */
/* PKA_PKA_RAM_DATA_109_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_109__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_109__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_110_ Bits */
/* PKA_PKA_RAM_DATA_110_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_110__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_110__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_111_ Bits */
/* PKA_PKA_RAM_DATA_111_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_111__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_111__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_112_ Bits */
/* PKA_PKA_RAM_DATA_112_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_112__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_112__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_113_ Bits */
/* PKA_PKA_RAM_DATA_113_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_113__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_113__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_114_ Bits */
/* PKA_PKA_RAM_DATA_114_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_114__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_114__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_115_ Bits */
/* PKA_PKA_RAM_DATA_115_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_115__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_115__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_116_ Bits */
/* PKA_PKA_RAM_DATA_116_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_116__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_116__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_117_ Bits */
/* PKA_PKA_RAM_DATA_117_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_117__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_117__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_118_ Bits */
/* PKA_PKA_RAM_DATA_118_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_118__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_118__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

