TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_119_ Bits */
/* PKA_PKA_RAM_DATA_119_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_119__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_119__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_120_ Bits */
/* PKA_PKA_RAM_DATA_120_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_120__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_120__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_121_ Bits */
/* PKA_PKA_RAM_DATA_121_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_121__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_121__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_122_ Bits */
/* PKA_PKA_RAM_DATA_122_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_122__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_122__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_123_ Bits */
/* PKA_PKA_RAM_DATA_123_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_123__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_123__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_124_ Bits */
/* PKA_PKA_RAM_DATA_124_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_124__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_124__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_125_ Bits */
/* PKA_PKA_RAM_DATA_125_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_125__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_125__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_126_ Bits */
/* PKA_PKA_RAM_DATA_126_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_126__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_126__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_127_ Bits */
/* PKA_PKA_RAM_DATA_127_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_127__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_127__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_128_ Bits */
/* PKA_PKA_RAM_DATA_128_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_128__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_128__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_129_ Bits */
/* PKA_PKA_RAM_DATA_129_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_129__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_129__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_130_ Bits */
/* PKA_PKA_RAM_DATA_130_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_130__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_130__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_131_ Bits */
/* PKA_PKA_RAM_DATA_131_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_131__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_131__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_132_ Bits */
/* PKA_PKA_RAM_DATA_132_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_132__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_132__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_133_ Bits */
/* PKA_PKA_RAM_DATA_133_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_133__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_133__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_134_ Bits */
/* PKA_PKA_RAM_DATA_134_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_134__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_134__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_135_ Bits */
/* PKA_PKA_RAM_DATA_135_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_135__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_135__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_136_ Bits */
/* PKA_PKA_RAM_DATA_136_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_136__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_136__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_137_ Bits */
/* PKA_PKA_RAM_DATA_137_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_137__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_137__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_138_ Bits */
/* PKA_PKA_RAM_DATA_138_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_138__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_138__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_139_ Bits */
/* PKA_PKA_RAM_DATA_139_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_139__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_139__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

