TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_162_ Bits */
/* PKA_PKA_RAM_DATA_162_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_162__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_162__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_163_ Bits */
/* PKA_PKA_RAM_DATA_163_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_163__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_163__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_164_ Bits */
/* PKA_PKA_RAM_DATA_164_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_164__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_164__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_165_ Bits */
/* PKA_PKA_RAM_DATA_165_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_165__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_165__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_166_ Bits */
/* PKA_PKA_RAM_DATA_166_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_166__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_166__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_167_ Bits */
/* PKA_PKA_RAM_DATA_167_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_167__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_167__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_168_ Bits */
/* PKA_PKA_RAM_DATA_168_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_168__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_168__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_169_ Bits */
/* PKA_PKA_RAM_DATA_169_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_169__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_169__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_170_ Bits */
/* PKA_PKA_RAM_DATA_170_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_170__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_170__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_171_ Bits */
/* PKA_PKA_RAM_DATA_171_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_171__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_171__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_172_ Bits */
/* PKA_PKA_RAM_DATA_172_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_172__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_172__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_173_ Bits */
/* PKA_PKA_RAM_DATA_173_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_173__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_173__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_174_ Bits */
/* PKA_PKA_RAM_DATA_174_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_174__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_174__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_175_ Bits */
/* PKA_PKA_RAM_DATA_175_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_175__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_175__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_176_ Bits */
/* PKA_PKA_RAM_DATA_176_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_176__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_176__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_177_ Bits */
/* PKA_PKA_RAM_DATA_177_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_177__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_177__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_178_ Bits */
/* PKA_PKA_RAM_DATA_178_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_178__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_178__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_179_ Bits */
/* PKA_PKA_RAM_DATA_179_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_179__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_179__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_180_ Bits */
/* PKA_PKA_RAM_DATA_180_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_180__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_180__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_181_ Bits */
/* PKA_PKA_RAM_DATA_181_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_181__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_181__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_182_ Bits */
/* PKA_PKA_RAM_DATA_182_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_182__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_182__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

