TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_183_ Bits */
/* PKA_PKA_RAM_DATA_183_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_183__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_183__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_184_ Bits */
/* PKA_PKA_RAM_DATA_184_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_184__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_184__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_185_ Bits */
/* PKA_PKA_RAM_DATA_185_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_185__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_185__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_186_ Bits */
/* PKA_PKA_RAM_DATA_186_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_186__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_186__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_187_ Bits */
/* PKA_PKA_RAM_DATA_187_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_187__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_187__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_188_ Bits */
/* PKA_PKA_RAM_DATA_188_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_188__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_188__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_189_ Bits */
/* PKA_PKA_RAM_DATA_189_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_189__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_189__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_190_ Bits */
/* PKA_PKA_RAM_DATA_190_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_190__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_190__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_191_ Bits */
/* PKA_PKA_RAM_DATA_191_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_191__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_191__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_192_ Bits */
/* PKA_PKA_RAM_DATA_192_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_192__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_192__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_193_ Bits */
/* PKA_PKA_RAM_DATA_193_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_193__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_193__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_194_ Bits */
/* PKA_PKA_RAM_DATA_194_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_194__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_194__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_195_ Bits */
/* PKA_PKA_RAM_DATA_195_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_195__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_195__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_196_ Bits */
/* PKA_PKA_RAM_DATA_196_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_196__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_196__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_197_ Bits */
/* PKA_PKA_RAM_DATA_197_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_197__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_197__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_198_ Bits */
/* PKA_PKA_RAM_DATA_198_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_198__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_198__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_199_ Bits */
/* PKA_PKA_RAM_DATA_199_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_199__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_199__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_200_ Bits */
/* PKA_PKA_RAM_DATA_200_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_200__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_200__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_201_ Bits */
/* PKA_PKA_RAM_DATA_201_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_201__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_201__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_202_ Bits */
/* PKA_PKA_RAM_DATA_202_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_202__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_202__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_203_ Bits */
/* PKA_PKA_RAM_DATA_203_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_203__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_203__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

