TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_226_ Bits */
/* PKA_PKA_RAM_DATA_226_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_226__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_226__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_227_ Bits */
/* PKA_PKA_RAM_DATA_227_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_227__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_227__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_228_ Bits */
/* PKA_PKA_RAM_DATA_228_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_228__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_228__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_229_ Bits */
/* PKA_PKA_RAM_DATA_229_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_229__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_229__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_230_ Bits */
/* PKA_PKA_RAM_DATA_230_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_230__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_230__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_231_ Bits */
/* PKA_PKA_RAM_DATA_231_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_231__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_231__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_232_ Bits */
/* PKA_PKA_RAM_DATA_232_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_232__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_232__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_233_ Bits */
/* PKA_PKA_RAM_DATA_233_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_233__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_233__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_234_ Bits */
/* PKA_PKA_RAM_DATA_234_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_234__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_234__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_235_ Bits */
/* PKA_PKA_RAM_DATA_235_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_235__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_235__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_236_ Bits */
/* PKA_PKA_RAM_DATA_236_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_236__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_236__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_237_ Bits */
/* PKA_PKA_RAM_DATA_237_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_237__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_237__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_238_ Bits */
/* PKA_PKA_RAM_DATA_238_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_238__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_238__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_239_ Bits */
/* PKA_PKA_RAM_DATA_239_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_239__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_239__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_240_ Bits */
/* PKA_PKA_RAM_DATA_240_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_240__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_240__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_241_ Bits */
/* PKA_PKA_RAM_DATA_241_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_241__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_241__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_242_ Bits */
/* PKA_PKA_RAM_DATA_242_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_242__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_242__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_243_ Bits */
/* PKA_PKA_RAM_DATA_243_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_243__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_243__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_244_ Bits */
/* PKA_PKA_RAM_DATA_244_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_244__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_244__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_245_ Bits */
/* PKA_PKA_RAM_DATA_245_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_245__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_245__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_246_ Bits */
/* PKA_PKA_RAM_DATA_246_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_246__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_246__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_247_ Bits */
/* PKA_PKA_RAM_DATA_247_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_247__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_247__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

