TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_248_ Bits */
/* PKA_PKA_RAM_DATA_248_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_248__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_248__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_249_ Bits */
/* PKA_PKA_RAM_DATA_249_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_249__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_249__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_250_ Bits */
/* PKA_PKA_RAM_DATA_250_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_250__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_250__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_251_ Bits */
/* PKA_PKA_RAM_DATA_251_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_251__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_251__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_252_ Bits */
/* PKA_PKA_RAM_DATA_252_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_252__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_252__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_253_ Bits */
/* PKA_PKA_RAM_DATA_253_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_253__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_253__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_254_ Bits */
/* PKA_PKA_RAM_DATA_254_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_254__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_254__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_255_ Bits */
/* PKA_PKA_RAM_DATA_255_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_255__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_255__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_256_ Bits */
/* PKA_PKA_RAM_DATA_256_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_256__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_256__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_257_ Bits */
/* PKA_PKA_RAM_DATA_257_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_257__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_257__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_258_ Bits */
/* PKA_PKA_RAM_DATA_258_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_258__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_258__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_259_ Bits */
/* PKA_PKA_RAM_DATA_259_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_259__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_259__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_260_ Bits */
/* PKA_PKA_RAM_DATA_260_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_260__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_260__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_261_ Bits */
/* PKA_PKA_RAM_DATA_261_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_261__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_261__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_262_ Bits */
/* PKA_PKA_RAM_DATA_262_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_262__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_262__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_263_ Bits */
/* PKA_PKA_RAM_DATA_263_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_263__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_263__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_264_ Bits */
/* PKA_PKA_RAM_DATA_264_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_264__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_264__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_265_ Bits */
/* PKA_PKA_RAM_DATA_265_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_265__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_265__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_266_ Bits */
/* PKA_PKA_RAM_DATA_266_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_266__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_266__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_267_ Bits */
/* PKA_PKA_RAM_DATA_267_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_267__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_267__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_268_ Bits */
/* PKA_PKA_RAM_DATA_268_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_268__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_268__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_269_ Bits */
/* PKA_PKA_RAM_DATA_269_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_269__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_269__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_270_ Bits */
/* PKA_PKA_RAM_DATA_270_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_270__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_270__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_271_ Bits */
/* PKA_PKA_RAM_DATA_271_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_271__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_271__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

