TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_272_ Bits */
/* PKA_PKA_RAM_DATA_272_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_272__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_272__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_273_ Bits */
/* PKA_PKA_RAM_DATA_273_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_273__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_273__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_274_ Bits */
/* PKA_PKA_RAM_DATA_274_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_274__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_274__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_275_ Bits */
/* PKA_PKA_RAM_DATA_275_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_275__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_275__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_276_ Bits */
/* PKA_PKA_RAM_DATA_276_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_276__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_276__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_277_ Bits */
/* PKA_PKA_RAM_DATA_277_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_277__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_277__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_278_ Bits */
/* PKA_PKA_RAM_DATA_278_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_278__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_278__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_279_ Bits */
/* PKA_PKA_RAM_DATA_279_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_279__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_279__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_280_ Bits */
/* PKA_PKA_RAM_DATA_280_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_280__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_280__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_281_ Bits */
/* PKA_PKA_RAM_DATA_281_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_281__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_281__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_282_ Bits */
/* PKA_PKA_RAM_DATA_282_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_282__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_282__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_283_ Bits */
/* PKA_PKA_RAM_DATA_283_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_283__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_283__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_284_ Bits */
/* PKA_PKA_RAM_DATA_284_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_284__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_284__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_285_ Bits */
/* PKA_PKA_RAM_DATA_285_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_285__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_285__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_286_ Bits */
/* PKA_PKA_RAM_DATA_286_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_286__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_286__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_287_ Bits */
/* PKA_PKA_RAM_DATA_287_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_287__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_287__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_288_ Bits */
/* PKA_PKA_RAM_DATA_288_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_288__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_288__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_289_ Bits */
/* PKA_PKA_RAM_DATA_289_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_289__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_289__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_290_ Bits */
/* PKA_PKA_RAM_DATA_290_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_290__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_290__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_291_ Bits */
/* PKA_PKA_RAM_DATA_291_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_291__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_291__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_292_ Bits */
/* PKA_PKA_RAM_DATA_292_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_292__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_292__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

