TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_293_ Bits */
/* PKA_PKA_RAM_DATA_293_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_293__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_293__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_294_ Bits */
/* PKA_PKA_RAM_DATA_294_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_294__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_294__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_295_ Bits */
/* PKA_PKA_RAM_DATA_295_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_295__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_295__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_296_ Bits */
/* PKA_PKA_RAM_DATA_296_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_296__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_296__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_297_ Bits */
/* PKA_PKA_RAM_DATA_297_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_297__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_297__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_298_ Bits */
/* PKA_PKA_RAM_DATA_298_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_298__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_298__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_299_ Bits */
/* PKA_PKA_RAM_DATA_299_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_299__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_299__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_300_ Bits */
/* PKA_PKA_RAM_DATA_300_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_300__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_300__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_301_ Bits */
/* PKA_PKA_RAM_DATA_301_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_301__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_301__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_302_ Bits */
/* PKA_PKA_RAM_DATA_302_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_302__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_302__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_303_ Bits */
/* PKA_PKA_RAM_DATA_303_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_303__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_303__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_304_ Bits */
/* PKA_PKA_RAM_DATA_304_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_304__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_304__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_305_ Bits */
/* PKA_PKA_RAM_DATA_305_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_305__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_305__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_306_ Bits */
/* PKA_PKA_RAM_DATA_306_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_306__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_306__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_307_ Bits */
/* PKA_PKA_RAM_DATA_307_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_307__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_307__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_308_ Bits */
/* PKA_PKA_RAM_DATA_308_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_308__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_308__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_309_ Bits */
/* PKA_PKA_RAM_DATA_309_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_309__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_309__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_310_ Bits */
/* PKA_PKA_RAM_DATA_310_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_310__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_310__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_311_ Bits */
/* PKA_PKA_RAM_DATA_311_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_311__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_311__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_312_ Bits */
/* PKA_PKA_RAM_DATA_312_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_312__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_312__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_313_ Bits */
/* PKA_PKA_RAM_DATA_313_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_313__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_313__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_314_ Bits */
/* PKA_PKA_RAM_DATA_314_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_314__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_314__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_315_ Bits */
/* PKA_PKA_RAM_DATA_315_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_315__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_315__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_316_ Bits */
/* PKA_PKA_RAM_DATA_316_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_316__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_316__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

