TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_317_ Bits */
/* PKA_PKA_RAM_DATA_317_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_317__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_317__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_318_ Bits */
/* PKA_PKA_RAM_DATA_318_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_318__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_318__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_319_ Bits */
/* PKA_PKA_RAM_DATA_319_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_319__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_319__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_320_ Bits */
/* PKA_PKA_RAM_DATA_320_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_320__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_320__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_321_ Bits */
/* PKA_PKA_RAM_DATA_321_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_321__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_321__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_322_ Bits */
/* PKA_PKA_RAM_DATA_322_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_322__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_322__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_323_ Bits */
/* PKA_PKA_RAM_DATA_323_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_323__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_323__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_324_ Bits */
/* PKA_PKA_RAM_DATA_324_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_324__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_324__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_325_ Bits */
/* PKA_PKA_RAM_DATA_325_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_325__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_325__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_326_ Bits */
/* PKA_PKA_RAM_DATA_326_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_326__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_326__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_327_ Bits */
/* PKA_PKA_RAM_DATA_327_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_327__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_327__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_328_ Bits */
/* PKA_PKA_RAM_DATA_328_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_328__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_328__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_329_ Bits */
/* PKA_PKA_RAM_DATA_329_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_329__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_329__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_330_ Bits */
/* PKA_PKA_RAM_DATA_330_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_330__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_330__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_331_ Bits */
/* PKA_PKA_RAM_DATA_331_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_331__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_331__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_332_ Bits */
/* PKA_PKA_RAM_DATA_332_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_332__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_332__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_333_ Bits */
/* PKA_PKA_RAM_DATA_333_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_333__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_333__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_334_ Bits */
/* PKA_PKA_RAM_DATA_334_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_334__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_334__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_335_ Bits */
/* PKA_PKA_RAM_DATA_335_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_335__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_335__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_336_ Bits */
/* PKA_PKA_RAM_DATA_336_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_336__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_336__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_337_ Bits */
/* PKA_PKA_RAM_DATA_337_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_337__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_337__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

