TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_361_ Bits */
/* PKA_PKA_RAM_DATA_361_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_361__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_361__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_362_ Bits */
/* PKA_PKA_RAM_DATA_362_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_362__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_362__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_363_ Bits */
/* PKA_PKA_RAM_DATA_363_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_363__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_363__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_364_ Bits */
/* PKA_PKA_RAM_DATA_364_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_364__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_364__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_365_ Bits */
/* PKA_PKA_RAM_DATA_365_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_365__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_365__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_366_ Bits */
/* PKA_PKA_RAM_DATA_366_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_366__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_366__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_367_ Bits */
/* PKA_PKA_RAM_DATA_367_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_367__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_367__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_368_ Bits */
/* PKA_PKA_RAM_DATA_368_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_368__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_368__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_369_ Bits */
/* PKA_PKA_RAM_DATA_369_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_369__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_369__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_370_ Bits */
/* PKA_PKA_RAM_DATA_370_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_370__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_370__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_371_ Bits */
/* PKA_PKA_RAM_DATA_371_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_371__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_371__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_372_ Bits */
/* PKA_PKA_RAM_DATA_372_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_372__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_372__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_373_ Bits */
/* PKA_PKA_RAM_DATA_373_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_373__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_373__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_374_ Bits */
/* PKA_PKA_RAM_DATA_374_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_374__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_374__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_375_ Bits */
/* PKA_PKA_RAM_DATA_375_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_375__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_375__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_376_ Bits */
/* PKA_PKA_RAM_DATA_376_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_376__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_376__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_377_ Bits */
/* PKA_PKA_RAM_DATA_377_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_377__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_377__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_378_ Bits */
/* PKA_PKA_RAM_DATA_378_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_378__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_378__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_379_ Bits */
/* PKA_PKA_RAM_DATA_379_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_379__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_379__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_380_ Bits */
/* PKA_PKA_RAM_DATA_380_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_380__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_380__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_381_ Bits */
/* PKA_PKA_RAM_DATA_381_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_381__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_381__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_382_ Bits */
/* PKA_PKA_RAM_DATA_382_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_382__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_382__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_383_ Bits */
/* PKA_PKA_RAM_DATA_383_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_383__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_383__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_384_ Bits */
/* PKA_PKA_RAM_DATA_384_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_384__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_384__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

