TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_455_ Bits */
/* PKA_PKA_RAM_DATA_455_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_455__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_455__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_456_ Bits */
/* PKA_PKA_RAM_DATA_456_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_456__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_456__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_457_ Bits */
/* PKA_PKA_RAM_DATA_457_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_457__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_457__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_458_ Bits */
/* PKA_PKA_RAM_DATA_458_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_458__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_458__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_459_ Bits */
/* PKA_PKA_RAM_DATA_459_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_459__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_459__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_460_ Bits */
/* PKA_PKA_RAM_DATA_460_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_460__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_460__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_461_ Bits */
/* PKA_PKA_RAM_DATA_461_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_461__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_461__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_462_ Bits */
/* PKA_PKA_RAM_DATA_462_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_462__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_462__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_463_ Bits */
/* PKA_PKA_RAM_DATA_463_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_463__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_463__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_464_ Bits */
/* PKA_PKA_RAM_DATA_464_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_464__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_464__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_465_ Bits */
/* PKA_PKA_RAM_DATA_465_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_465__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_465__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_466_ Bits */
/* PKA_PKA_RAM_DATA_466_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_466__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_466__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_467_ Bits */
/* PKA_PKA_RAM_DATA_467_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_467__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_467__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_468_ Bits */
/* PKA_PKA_RAM_DATA_468_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_468__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_468__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_469_ Bits */
/* PKA_PKA_RAM_DATA_469_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_469__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_469__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_470_ Bits */
/* PKA_PKA_RAM_DATA_470_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_470__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_470__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_471_ Bits */
/* PKA_PKA_RAM_DATA_471_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_471__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_471__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_472_ Bits */
/* PKA_PKA_RAM_DATA_472_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_472__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_472__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_473_ Bits */
/* PKA_PKA_RAM_DATA_473_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_473__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_473__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_474_ Bits */
/* PKA_PKA_RAM_DATA_474_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_474__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_474__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_475_ Bits */
/* PKA_PKA_RAM_DATA_475_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_475__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_475__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_476_ Bits */
/* PKA_PKA_RAM_DATA_476_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_476__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_476__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

