TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_477_ Bits */
/* PKA_PKA_RAM_DATA_477_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_477__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_477__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_478_ Bits */
/* PKA_PKA_RAM_DATA_478_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_478__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_478__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_479_ Bits */
/* PKA_PKA_RAM_DATA_479_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_479__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_479__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_480_ Bits */
/* PKA_PKA_RAM_DATA_480_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_480__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_480__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_481_ Bits */
/* PKA_PKA_RAM_DATA_481_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_481__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_481__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_482_ Bits */
/* PKA_PKA_RAM_DATA_482_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_482__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_482__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_483_ Bits */
/* PKA_PKA_RAM_DATA_483_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_483__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_483__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_484_ Bits */
/* PKA_PKA_RAM_DATA_484_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_484__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_484__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_485_ Bits */
/* PKA_PKA_RAM_DATA_485_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_485__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_485__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_486_ Bits */
/* PKA_PKA_RAM_DATA_486_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_486__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_486__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_487_ Bits */
/* PKA_PKA_RAM_DATA_487_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_487__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_487__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_488_ Bits */
/* PKA_PKA_RAM_DATA_488_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_488__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_488__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_489_ Bits */
/* PKA_PKA_RAM_DATA_489_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_489__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_489__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_490_ Bits */
/* PKA_PKA_RAM_DATA_490_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_490__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_490__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_491_ Bits */
/* PKA_PKA_RAM_DATA_491_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_491__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_491__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_492_ Bits */
/* PKA_PKA_RAM_DATA_492_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_492__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_492__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_493_ Bits */
/* PKA_PKA_RAM_DATA_493_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_493__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_493__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_494_ Bits */
/* PKA_PKA_RAM_DATA_494_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_494__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_494__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_495_ Bits */
/* PKA_PKA_RAM_DATA_495_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_495__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_495__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_496_ Bits */
/* PKA_PKA_RAM_DATA_496_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_496__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_496__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_497_ Bits */
/* PKA_PKA_RAM_DATA_497_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_497__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_497__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_498_ Bits */
/* PKA_PKA_RAM_DATA_498_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_498__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_498__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_499_ Bits */
/* PKA_PKA_RAM_DATA_499_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_499__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_499__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_500_ Bits */
/* PKA_PKA_RAM_DATA_500_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_500__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_500__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_501_ Bits */
/* PKA_PKA_RAM_DATA_501_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_501__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_501__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

