TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_pka.h
/* PKA_PKA_RAM_DATA_502_ Bits */
/* PKA_PKA_RAM_DATA_502_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_502__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_502__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_503_ Bits */
/* PKA_PKA_RAM_DATA_503_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_503__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_503__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_504_ Bits */
/* PKA_PKA_RAM_DATA_504_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_504__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_504__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_505_ Bits */
/* PKA_PKA_RAM_DATA_505_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_505__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_505__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_506_ Bits */
/* PKA_PKA_RAM_DATA_506_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_506__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_506__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_507_ Bits */
/* PKA_PKA_RAM_DATA_507_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_507__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_507__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_508_ Bits */
/* PKA_PKA_RAM_DATA_508_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_508__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_508__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_509_ Bits */
/* PKA_PKA_RAM_DATA_509_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_509__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_509__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_510_ Bits */
/* PKA_PKA_RAM_DATA_510_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_510__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_510__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_PKA_RAM_DATA_511_ Bits */
/* PKA_PKA_RAM_DATA_511_[VECTOR_DATA] Bits */
#define PKA_PKA_RAM_DATA_511__VECTOR_DATA_OFS    (0)                             /* !< VECTOR_DATA Offset */
#define PKA_PKA_RAM_DATA_511__VECTOR_DATA_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< Vector DATA in RAM */

/* PKA_AIC_POL_CTRL Bits */
/* PKA_AIC_POL_CTRL[PKA_INT_0] Bits */
#define PKA_AIC_POL_CTRL_PKA_INT_0_OFS           (0)                             /* !< PKA_INT_0 Offset */
#define PKA_AIC_POL_CTRL_PKA_INT_0_MASK          ((uint32_t)0x00000001U)         /* !< Individual polarity (high
                                                                                    level/rising edge or low
                                                                                    level/falling edge) control bits per
                                                                                    interrupt input. The signal is as
                                                                                    follows: 0=Low level/falling edge
                                                                                    1=High level/rising edge Note: The
                                                                                    PolarityControl must be set to 1 for
                                                                                    all interrupts during the
                                                                                    initialization phase of the EIP-150. */
/* PKA_AIC_POL_CTRL[PKA_INT_1] Bits */
#define PKA_AIC_POL_CTRL_PKA_INT_1_OFS           (1)                             /* !< PKA_INT_1 Offset */
#define PKA_AIC_POL_CTRL_PKA_INT_1_MASK          ((uint32_t)0x00000002U)
/* PKA_AIC_POL_CTRL[PKA_INT_2] Bits */
#define PKA_AIC_POL_CTRL_PKA_INT_2_OFS           (2)                             /* !< PKA_INT_2 Offset */
#define PKA_AIC_POL_CTRL_PKA_INT_2_MASK          ((uint32_t)0x00000004U)
/* PKA_AIC_POL_CTRL[TRNG_IRQ] Bits */
#define PKA_AIC_POL_CTRL_TRNG_IRQ_OFS            (3)                             /* !< TRNG_IRQ Offset */
#define PKA_AIC_POL_CTRL_TRNG_IRQ_MASK           ((uint32_t)0x00000008U)
/* PKA_AIC_POL_CTRL[SL_ERR_INT] Bits */
#define PKA_AIC_POL_CTRL_SL_ERR_INT_OFS          (5)                             /* !< SL_ERR_INT Offset */
#define PKA_AIC_POL_CTRL_SL_ERR_INT_MASK         ((uint32_t)0x00000020U)
/* PKA_AIC_POL_CTRL[PROTECTION_INT] Bits */
#define PKA_AIC_POL_CTRL_PROTECTION_INT_OFS      (6)                             /* !< PROTECTION_INT Offset */
#define PKA_AIC_POL_CTRL_PROTECTION_INT_MASK     ((uint32_t)0x00000040U)

/* PKA_AIC_TYPE_CTRL Bits */
/* PKA_AIC_TYPE_CTRL[PKA_INT_0] Bits */
#define PKA_AIC_TYPE_CTRL_PKA_INT_0_OFS          (0)                             /* !< PKA_INT_0 Offset */
#define PKA_AIC_TYPE_CTRL_PKA_INT_0_MASK         ((uint32_t)0x00000001U)         /* !< Signal type (level or edge) control
                                                                                    bits for each interrupt input.
                                                                                    #br#0=level (the interrupt source
                                                                                    level determines the raw status)
                                                                                    #br#1=edge (the interrupt source is
                                                                                    connected to edge detector and output
                                                                                    of edge detector #br#determines the
                                                                                    raw status ) */
/* PKA_AIC_TYPE_CTRL[PKA_INT_1] Bits */
#define PKA_AIC_TYPE_CTRL_PKA_INT_1_OFS          (1)                             /* !< PKA_INT_1 Offset */
#define PKA_AIC_TYPE_CTRL_PKA_INT_1_MASK         ((uint32_t)0x00000002U)         /* !< Individual int level edge control */
/* PKA_AIC_TYPE_CTRL[PKA_INT_2] Bits */
#define PKA_AIC_TYPE_CTRL_PKA_INT_2_OFS          (2)                             /* !< PKA_INT_2 Offset */
#define PKA_AIC_TYPE_CTRL_PKA_INT_2_MASK         ((uint32_t)0x00000004U)         /* !< Individual int level edge control */
/* PKA_AIC_TYPE_CTRL[TRNG_IRQ] Bits */
#define PKA_AIC_TYPE_CTRL_TRNG_IRQ_OFS           (3)                             /* !< TRNG_IRQ Offset */
#define PKA_AIC_TYPE_CTRL_TRNG_IRQ_MASK          ((uint32_t)0x00000008U)         /* !< Individual int level edge control */
/* PKA_AIC_TYPE_CTRL[SL_ERR_INT] Bits */
#define PKA_AIC_TYPE_CTRL_SL_ERR_INT_OFS         (5)                             /* !< SL_ERR_INT Offset */
#define PKA_AIC_TYPE_CTRL_SL_ERR_INT_MASK        ((uint32_t)0x00000020U)         /* !< Individual int level edge control */
/* PKA_AIC_TYPE_CTRL[PROTECTION_INT] Bits */
#define PKA_AIC_TYPE_CTRL_PROTECTION_INT_OFS     (6)                             /* !< PROTECTION_INT Offset */
#define PKA_AIC_TYPE_CTRL_PROTECTION_INT_MASK    ((uint32_t)0x00000040U)         /* !< Individual int level edge control */

/* PKA_AIC_ENABLE_CTRL Bits */
/* PKA_AIC_ENABLE_CTRL[ENABLECONTROL] Bits */
#define PKA_AIC_ENABLE_CTRL_ENABLECONTROL_OFS    (0)                             /* !< ENABLECONTROL Offset */
#define PKA_AIC_ENABLE_CTRL_ENABLECONTROL_MASK   ((uint32_t)0x0000000FU)         /* !< Individual enable control bits per
                                                                                    interrupt input */
/* PKA_AIC_ENABLE_CTRL[ENABLECONTROL] Bits */

/* PKA_AIC_RAW_STAT Bits */
/* PKA_AIC_RAW_STAT[RAWSTATUS] Bits */
#define PKA_AIC_RAW_STAT_RAWSTATUS_OFS           (0)                             /* !< RAWSTATUS Offset */
#define PKA_AIC_RAW_STAT_RAWSTATUS_MASK          ((uint32_t)0x0000000FU)         /* !< Interrupt status */
/* PKA_AIC_RAW_STAT[RAWSTATUS] Bits */

